import { SequenceConfig } from "../core/types";
import { group, seq } from "./seq";

export const configs: SequenceConfig[] = [
  ...[
    ["代数", "儿何"],
    ["这是一个", "下等的論文"],
    ["已經到了", "無恥的地步"],
    ["從頭到尾，", "秘密行動"],
    ["朋比", "为奸！"],
    ["居心", "叵测！"],
    ["有没有", "利益輸送", "？"],

    //
    ["參加的学生很少，", "都躲在甚么地方了,", "？"],
    ["羞之", "羞之", "！"],
    ["獎一个", "华为手表"],
    ["我們学生", "躲在遊戲屋，", "不觉得羞愧", "？"],
    ["何其斤斤计较於", "一餐之饱食"],
    ["昔日孔子称道颜回，", "豈在一飲一食乎？"],
    ["尋天人樂處，", "拓万古心胸。"],
    ["這個事情我們現在要正視，", "你們自己提出", "如何交待。"],
    ["你们都比我聪明，", "只是妄自菲薄而已！"],
    ["是誰負責？", "羞也不羞？"],
    ["這種成績，", "使人汗顏！", "如此成績，", "如何招生", "？"],
    ["這些競賽", "其實是硬指標，", "教好學生", "是你們的責任，", "不是你們在幫忙誰！"],
    ["升級和加薪", "都會有直接關係。"],
    ["一个钟头的演讲，", "讓我知道", "代数", "儿何", "学家注意的前沿問题，，"],
    ["这个机遇", "不可特意去求", "！"],
    ["但是假如我不愿意浪费", "六个钟頭", "开車子，", "恐怕这些工作", "会给别人做去了!"],
    ["章台柳，", "章台柳，", "昔日青青", "今在否。"],
    ["纵使长條", "似旧垂，", "也広攀折", "他人手。"],

    //
    ["大家可以討論，", "正如小孩子們喜歡吃零食，", "不願意吃正餐一樣。"],
    ["花點時間去挑戰", "數学有趣的難題，", "不再討論這件事情了"],
    ["躲在家中", "玩耍游戏，", "置一流学問於不顾", "！"],
    ["要求", "不會改變", "！"],
    ["Atiyah ", "在晚年宣布：", "假如他熟悉德文的話，", "他可能成為數論専家"],
    ["本人很佩服", "你們幾个年輕人挑戰的勇气，", "但是人望高處，", "水向下流！"],
    ["我本人覺得愈有意思，", "愈有困難的事情，", "愈有收獲，", "愈值得挑戰，", "不學習", "就如水向下流！"],
    ["有外文的知識，", "直接影響", "學數學的不同学問。"],
    ["考試", "是閉巻，", "不容許", "帶手机"],
    ["不得用", "電子設備。", "用的話", "和不考沒有分別"],
  ].map(s => group({ atoms: s }))
];
