import { SequenceConfig } from "../core/types";
import { group, seq } from "./seq";

export const configs: SequenceConfig[] = [
  ...[
    ["代数", "儿何"],
    ["这是一个", "下等的論文"],
    ["已經到了", "無恥的地步"],
    ["從頭到尾，", "秘密行動"],
    ["朋比为奸", "！"],
    ["居心叵测", "！"],
    ["有没有", "利益輸送", "？"],
    ["要求不會改變", "！"],
    ["羞之", "羞之", "！"],
    ["獎一个", "华为手表"],
    ["尋天人樂處，", "拓万古心胸。"], 
    ["這種成績，", "使人汗顏！", "如此成績，", "如何招生", "？"],
    ["何其斤斤计较於", "一餐之饱食"],
    ["我們学生躲在遊戲屋，", "不觉得羞愧", "？"],
    ["大家可以討論，", "正如小孩子們喜歡吃零食，", "不願意吃正餐一樣。"],
    ["花點時間去挑戰數学有趣的難題，", "不再討論這件事情了"],
    ["躲在家中", "玩耍游戏，", "置一流学問於不顾", "！"]
  ].map(s => group({ atoms: s }))
];
